In [3]:
import pandas as pd

<h1 style="color: blue">When data is arranged in columns</h1>

In [4]:
names = ['X', 'Y', 'Z', 'A']
hobbies = ['fishing', 'reading', 'coding', 'pc games']
height = ['5.5\'', '5.0\'', "6.3'", '4.0\'']

In [10]:
information = pd.DataFrame({'Name': names , 'Hobbies': hobbies, 'Height': height})

In [11]:
information

  Name   Hobbies Height
0    X   fishing   5.5'
1    Y   reading   5.0'
2    Z    coding   6.3'
3    A  pc games   4.0'

In [12]:
information.set_index('Name', inplace = True)

In [15]:
information

       Hobbies Height
Name
X      fishing   5.5'
Y      reading   5.0'
Z       coding   6.3'
A     pc games   4.0'

In [16]:
information.set_index("Height", inplace = True)

# <h1 style="color: blue">When data is arranged in rows</h1>

In [18]:
information.T

Height      5.5'     5.0'    6.3'      4.0'
Hobbies  fishing  reading  coding  pc games

In [22]:
row1 = ["Happy", "coding", "4.0'"] 
row2 = ["Happier", "learning", "4.3'"]
row3 = ["Happiest", "reading", "4.2'"]

In [24]:
info2 = pd.DataFrame(data = [row1, row2, row3], columns = ["Name2", "Hobbies2", "Height2"])

In [25]:
info2

      Name2  Hobbies2 Height2
0     Happy    coding    4.0'
1   Happier  learning    4.3'
2  Happiest   reading    4.2'

In [26]:
info2.set_index("Name2", inplace = True)

In [27]:
info2

          Hobbies2 Height2
Name2
Happy       coding    4.0'
Happier   learning    4.3'
Happiest   reading    4.2'

In [42]:
df = pd.Series(data = hobbies, name = "Hobbies").to_frame()

In [43]:
df

    Hobbies
0   fishing
1   reading
2    coding
3  pc games

In [44]:
df['Height'] = height

In [45]:
df

    Hobbies Height
0   fishing   5.5'
1   reading   5.0'
2    coding   6.3'
3  pc games   4.0'